// MockData.tsx
export const mockApiResponse = {
  date: "2025-05-09",
  fclt: {
    name: "카이마루",
    type: "cafeteria",
    morning_menu: [
      {
        course_name: "천원의 아침밥",
        price: 1000,
        menu_list: [
          ["쌀밥", []],
          ["유채된장국", [5, 6]],
          ["비엔나야채볶음", [1, 5, 6, 12, 15]],
          ["청경채겉절이", []],
          ["맛김치/아이스홍시", [5, 6, 9, 13]],
          ["도시락김/숭늉", []]
        ]
      }
    ],
    lunch_menu: [
      {
        course_name: "자율배식",
        price: 5500,
        menu_list: [
          ["쌀밥/흑미밥", []],
          ["미역오이냉국", []],
          ["춘천닭갈비", [5, 6, 15]],
          ["달콤볼어묵탕수", []],
          ["숙주나물", [5]],
          ["맛김치", [5, 6, 9, 13]]
        ]
      },
      {
        course_name: "A코너",
        price: 5500,
        menu_list: [
          ["돈불고기비빔국수", [5, 6, 10, 18]],
          ["스파클링에이드", []]
        ]
      },
      {
        course_name: "B코너",
        price: 6500,
        menu_list: [
          ["소불고기버섯덮밥", [5, 6, 16, 18]],
          ["아이스트로피칼바", []]
        ]
      }
    ],
    dinner_menu: [
      {
        course_name: "석식",
        price: 5500,
        menu_list: [
          ["쌀밥", []],
          ["뼈없는감자탕", [5, 6, 10, 16]],
          ["미트볼토마토소스조림", [1, 2, 5, 6, 12, 15]],
          ["맛살계란찜", [1, 5, 6]],
          ["돌나물무침", []],
          ["맛김치", [5, 6, 9, 13]]
        ]
      }
    ]
  },
  west: {
    name: "서맛골",
    type: "cafeteria",
    morning_menu: [
      {
        course_name: "천원의 아침밥",
        price: 1000,
        menu_list: [
          ["백미밥", []],
          ["소고기배추국", [5, 6, 16]],
          ["오징어까스&타르소스", [1, 6, 17]],
          ["콩조림", [5, 6]],
          ["도시락김", []],
          ["김치", [9]],
          ["누룽지", []],
          ["떠먹는요거트", [2]]
        ]
      }
    ],
    lunch_menu: [
      {
        course_name: "중식",
        price: 5000,
        menu_list: [
          ["백미밥", []],
          ["유부채된장국", [5, 6]],
          ["고구마함박스테이크&소스", [1, 2, 5, 6, 10, 12, 16]],
          ["콩나물어묵조림", [6]],
          ["미나리무생채", [5, 6]],
          ["김치", [9]],
          ["양배추샐러드&드레싱", [1, 6]]
        ]
      },
      {
        course_name: "일품",
        price: 6000,
        menu_list: [
          ["돌솥비빔밥", [5, 6, 16]],
          ["유부채된장국", [5, 6]],
          ["김치", [9]],
          ["양배추샐러드&드레싱", [1, 6]]
        ]
      }
    ],
    dinner_menu: [
      {
        course_name: "석식",
        price: 5000,
        menu_list: [
          ["백미밥", []],
          ["떡만두국", [2, 5, 6, 10, 16]],
          ["난자완스", [1, 5, 6, 10, 16]],
          ["김자반", []],
          ["배추나물", []],
          ["깍두기", [5, 6, 9]],
          ["양배추샐러드&드레싱", [1, 6]]
        ]
      }
    ]
  },
  east1: {
    name: "동맛골 1층",
    type: "cafeteria",
    morning_menu: [
      {
        course_name: "한식코너",
        price: 3500,
        menu_list: [
          ["쌀밥", []],
          ["(뚝)얼큰해물탕", [5, 17, 18, 21]],
          ["단무지", []],
          ["그린샐러드", []],
          ["배추김치", [9]],
          ["누룽지", []]
        ]
      }
    ],
    lunch_menu: [
      {
        course_name: "일품코너 1",
        price: 5500,
        menu_list: [
          ["돈까스김치나베", [1, 6, 9, 10, 13]],
          ["후리가케밥", []],
          ["그린샐러드/단무지/깍두기", [9]]
        ]
      },
      {
        course_name: "일품코너 2",
        price: 6000,
        menu_list: [
          ["자장덮밥", [5, 6, 10]],
          ["우동국물", [6]],
          ["군만두", [5, 6, 10]],
          ["탕수육", [6, 10, 15]],
          ["그린샐러드/단무지/깍두기", [9]]
        ]
      }
    ],
    dinner_menu: []
  },
  east2: {
    name: "동맛골 2층",
    type: "cafeteria",
    morning_menu: [],
    lunch_menu: [
      {
        course_name: "특식",
        price: 6500,
        menu_list: [
          ["-품절12:14-", []],
          ["닭칼국수", [6, 15]],
          ["물만두", [5, 6, 10]],
          ["배추겉절이", [9]],
          ["깍두기", [9]],
          ["그린샐러드", []]
        ]
      },
      {
        course_name: "셋트메뉴",
        price: 6500,
        menu_list: [
          ["잡곡밥", []],
          ["소고기탕국", [5, 16]],
          ["버섯간장불고기", [10]],
          ["부들어묵피망볶음", [6]],
          ["양념무말랭이", []],
          ["배추김치", [9]],
          ["그린샐러드", []],
          ["누룽지/결명자차", []]
        ]
      }
    ],
    dinner_menu: []
  },
  emp: {
    name: "교수회관",
    type: "cafeteria",
    morning_menu: [],
    lunch_menu: [
      {
        course_name: "1층 자율배식",
        price: 5500,
        menu_list: [
          ["쌀밥", []],
          ["얼큰어묵국", [5, 6]],
          ["숯불마늘닭살조림", [5, 6, 15, 18]],
          ["쌈다시마&초고추장", []],
          ["청경채무침", []],
          ["맛김치", [9, 13]],
          ["그린샐러드&드레싱", [1, 5, 6]]
        ]
      },
      {
        course_name: "2층 자율배식",
        price: 6500,
        menu_list: [
          ["쌀밥", []],
          ["얼큰어묵국", [5, 6]],
          ["숯불마늘닭살조림", [5, 6, 15, 18]],
          ["열무김치비빔밥&고추장&김가루&참기름", [1, 9, 13]],
          ["쌈다시마&초고추장", []],
          ["청경채무침", []],
          ["포기김치", [9, 13]],
          ["마테차", []],
          ["그린샐러드&드레싱", [1, 5, 6]]
        ]
      }
    ],
    dinner_menu: [
      {
        course_name: "자율배식",
        price: 5500,
        menu_list: [
          ["추가밥", []],
          ["크림스프", [1, 2, 5, 6]],
          ["로제스파게티", [1, 2, 5, 10, 12]],
          ["완자야채조림", [5, 6, 15, 18]],
          ["참나물무침", []],
          ["맛김치", [9, 13]],
          ["그린샐러드&드레싱", [1, 5, 6]]
        ]
      }
    ]
  }
};